AUTO_config_TK_pesok/src/Catalogs/ТК_ГрафикиТСД/ТК_ГрафикиТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТК_ГрафикиТСД</name>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.ТК_ВидыПериодичностиГрафикаТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДниНедели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидГрафика</name>
    <type>
      <types>EnumRef.ТК_ВидыЗадачТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураЭлементы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОтборов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЧисло</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварныеГруппы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТорговыеОбъекты</name>
    <attributes>
      <name>ТорговаяПлощадка</name>
      <type>
        <types>CatalogRef.ТорговыеПлощадки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВключаяНижестоящие</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварныеЭлементы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Enums/ТК_ВидыПериодичностиГрафикаТСД/ТК_ВидыПериодичностиГрафикаТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТК_ВидыПериодичностиГрафикаТСД</name>
  <enumValues>
    <name>Еженедельно</name>
    <comment>Раз в неделю</comment>
  </enumValues>
  <enumValues>
    <name>РазВДвеНедели</name>
  </enumValues>
  <enumValues>
    <name>РазВТриНедели</name>
  </enumValues>
  <enumValues>
    <name>РазВЧетыреНедели</name>
  </enumValues>
  <enumValues>
    <name>НаДату</name>
  </enumValues>
  <enumValues>
    <name>НаДатуМесяца</name>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Enums/ТК_ВидыЗадачТСД/ТК_ВидыЗадачТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТК_ВидыЗадачТСД</name>
  <enumValues>
    <name>ВернутьПоставщику</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
  </enumValues>
  <enumValues>
    <name>ВерификацияЦенников</name>
  </enumValues>
  <enumValues>
    <name>ТБД</name>
  </enumValues>
  <enumValues>
    <name>ГрафикИнвентаризаций</name>
  </enumValues>
  <enumValues>
    <name>ГрафикТНП</name>
    <comment>Товар непригодный к продаже</comment>
  </enumValues>
  <enumValues>
    <name>Уведомление</name>
  </enumValues>
  <enumValues>
    <name>ПоказанияЭлектроСчетчиков</name>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Catalogs/ТК_ГрафикиТСД/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	
	Если ЭтоНовый() Тогда
		Автор 				  = Пользователи.ТекущийПользователь();

		ПодразделениеКомпании = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Автор, ПодразделениеКомпании);

	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивУдалить = Новый Массив;
	Если Периодичность = Перечисления.ТК_ВидыПериодичностиГрафикаТСД.НаДату Тогда
		
		МассивУдалить.Добавить("ДниНедели");
		МассивУдалить.Добавить("ДатаЧисло");
	ИначеЕсли Периодичность = Перечисления.ТК_ВидыПериодичностиГрафикаТСД.НаДатуМесяца Тогда
		МассивУдалить.Добавить("Дата");
		МассивУдалить.Добавить("ДниНедели");
	Иначе
		МассивУдалить.Добавить("Дата");
		МассивУдалить.Добавить("ДатаЧисло");


	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивУдалить);

	
	
	Если Периодичность = Перечисления.ТК_ВидыПериодичностиГрафикаТСД.НаДатуМесяца Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТК_ГрафикиТСДТорговыеОбъекты.Ссылка КАК График,
		|	ТК_ГрафикиТСДТорговыеОбъекты.ТорговаяПлощадка КАК ТорговаяПлощадка
		|ИЗ
		|	Справочник.ТК_ГрафикиТСД.ТорговыеОбъекты КАК ТК_ГрафикиТСДТорговыеОбъекты
		|ГДЕ
		|	ТК_ГрафикиТСДТорговыеОбъекты.ТорговаяПлощадка В(&МассивТП)
		|	И НЕ ТК_ГрафикиТСДТорговыеОбъекты.Ссылка = &ЭтотГрафик
		|	И ТК_ГрафикиТСДТорговыеОбъекты.Ссылка.Активный
		|	И ТК_ГрафикиТСДТорговыеОбъекты.Ссылка.ВидГрафика = &ВидГрафика
		|	И ТК_ГрафикиТСДТорговыеОбъекты.Ссылка.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("МассивТП", ТорговыеОбъекты.ВыгрузитьКолонку("ТорговаяПлощадка"));
		Запрос.УстановитьПараметр("ЭтотГрафик", Ссылка);
		Запрос.УстановитьПараметр("ВидГрафика", ВидГрафика);

		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю(Строка(ВыборкаДетальныеЗаписи.ТорговаяПлощадка) +" уже включен в график "+Строка(ВыборкаДетальныеЗаписи.График));
		КонецЦикла;
		
	КонецЕсли;
	
	Если ВидГрафика = Перечисления.ТК_ВидыЗадачТСД.ВерификацияЦенников Тогда
		
		Если ТоварныеГруппы.Количество() = 0 Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Група товаров на заполнена");
		Иначе
			Для Каждого стрГруппа Из ТоварныеГруппы Цикл 
				Если Не ЗначениеЗаполнено(стрГруппа.Номенклатура) Тогда
					Отказ = Истина;
					ОбщегоНазначения.СообщитьПользователю("Не заполнена группа товаров "+Строка(стрГруппа.НомерСтроки));
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	
КонецПроцедуры
	
#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
